{
    "version": "https://jsonfeed.org/version/1",
    "title": "MakeMyResume Guide",
    "description": "",
    "home_page_url": "https://guide.makemyresume.co.in",
    "feed_url": "https://guide.makemyresume.co.in/feed.json",
    "user_comment": "",
    "icon": "https://guide.makemyresume.co.in/media/website/MakeMyResume-Guide.svg",
    "author": {
        "name": "MakeMyResume"
    },
    "items": [
        {
            "id": "https://guide.makemyresume.co.in/how-far-back-should-a-resume-go/",
            "url": "https://guide.makemyresume.co.in/how-far-back-should-a-resume-go/",
            "title": "How Far Back Should A Resume Go? ",
            "summary": "Your resume should go back 15 to 20 years, at most. It boils down to three major reasons: According to TalentWorks’ research, your hireability drops by 8% annually after you cross the age of 35. Recruiters guess your age using your graduation details, and your&hellip;",
            "content_html": "<p><span style=\"font-weight: 400;\">Your resume should go back 15 to 20 years, </span><i><span style=\"font-weight: 400;\">at most</span></i><span style=\"font-weight: 400;\">. </span></p>\n<h2><span style=\"font-weight: 400;\">Why just 15-20 years?</span></h2>\n<p><span style=\"font-weight: 400;\">It boils down to three major reasons:</span></p>\n<h3>Hireability</h3>\n<p><span style=\"font-weight: 400;\">According to </span><a href=\"https://talent.works/2018/01/08/the-science-of-the-job-search-part-i-13-data-backed-ways-to-win/\" rel=\"nofollow\"><span style=\"font-weight: 400;\">TalentWorks’ research</span></a><span style=\"font-weight: 400;\">, your hireability drops by 8% annually after you cross the age of 35. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">Recruiters guess your age using your graduation details, and your hireability in their eyes could fall if you’re above the ‘age limit’.</span></p>\n<h3><strong>Resume Length</strong></h3>\n<p><span style=\"font-weight: 400;\">If you’re an industry veteran with a wealth of experience, expounding upon it, especially older stints and achievements, can prove detrimental. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">Your resume could easily exceed 3 pages, the (widely recognized) upper limit for resume length. Unless you’re an academic, scientist or teacher/professor, resumes longer than 3 pages reduce your chances of getting an interview.</span></p>\n<h3><strong>Relevancy</strong></h3>\n<p><span style=\"font-weight: 400;\">The further back your resume goes, the less relevant it becomes to the role you’re applying to. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">The skill sets, expertise, technical functions &amp; duties differ so significantly that what you’ve learned and executed back then would have little to no impact on your profile and knowledge base today. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">Thus, a short, crisp and relevant resume trumps an excessively lengthy one any day of the week!</span></p>\n<h2><span style=\"font-weight: 400;\">Could you explain further?</span></h2>\n<p><span style=\"font-weight: 400;\">Sure! </span></p>\n<p><span style=\"font-weight: 400;\">Recruiters want young blood in their organizations for fresher perspectives and contemporary knowledge of industry trends &amp; skill sets. </span><span style=\"font-weight: 400;\"><br></span></p>\n<p><span style=\"font-weight: 400;\">For example, let’s say you’re 40, and graduated 20 years back. After 10 years of work ex, you decided to change your field, and are now applying for a very senior position at a unicorn. Since it is 2021 now, your resume mentions your graduation date as 2001. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">Using this, they can infer that you’re roughly in the 38-43 bracket (considering the length of courses, early/late schooling, etc.), and your chances of being hired compared to say a 30ish-year-old who graduated in 2011, fall automatically. </span></p>\n<p><span style=\"font-weight: 400;\">Thus, if your resume is restricted to your work experience of the last 15 years, they cannot accurately guess your age as being 35+ (though to be honest, it’s an easy calculation, but then they do not spend that much time during the first few rounds of resume filtering).</span></p>\n<p><a href=\"https://jobs.theguardian.com/article/does-your-cv-pass-the-30-second-speed-test-/\" rel=\"nofollow\"><span style=\"font-weight: 400;\">Recruiters spend roughly 6-30 seconds</span></a><span style=\"font-weight: 400;\"> scanning your resume during the initial resume screening processes. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">The longer your content, the lesser time they spend per page - do you really want them to miss out on important content because your resume was too long? </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">Keeping your resume to a manageable 2 pages (3 at most, if you’re applying for a CXO-level position) ensures it’s packed with information &amp; important details while excluding irrelevant and unimportant snippets.</span><span style=\"font-weight: 400;\"><br></span></p>\n<p><span style=\"font-weight: 400;\">Step into the shoes of a recruiter that is hiring someone for a senior management position at an MNC. It requires leadership, foresight, vast knowledge of macro &amp; micro trends in the industry, excellent people-management &amp; negotiation skills. </span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\"><br></span><span style=\"font-weight: 400;\">Would the kind of work a potential candidate did at an intern- or entry-level position 25 years back have the slightest importance or relevancy in terms of the knowledge or experience required for the position? Obviously not! </span></p>\n<p><span style=\"font-weight: 400;\">Consequently, either completely eliminating or only very briefly mentioning these is the preferred practice and norm, especially since it helps in reducing the length of your resume and even gives you more space to highlight recent and more relevant experience and achievements which could go a long way towards getting you that interview.</span></p>\n<p><strong>TL;DR</strong></p>\n<p><span style=\"font-weight: 400;\">Your resume should go back no more than 15-20 years from the time of applying to a role. It helps the resume be of a manageable length, reduces the chance of an age bias working against you, and provides a much more relevant and informative resume!</span></p>",
            "image": "https://guide.makemyresume.co.in/media/posts/54/photo-1506784365847-bbad939e93351",
            "author": {
                "name": "MakeMyResume"
            },
            "tags": [
                   "Resume"
            ],
            "date_published": "2021-07-09T14:20:15+05:30",
            "date_modified": "2021-07-09T14:34:07+05:30"
        },
        {
            "id": "https://guide.makemyresume.co.in/job-search-action-plan/",
            "url": "https://guide.makemyresume.co.in/job-search-action-plan/",
            "title": "2021 Job Search - Definitive Action Plan",
            "summary": "<p>A job search can be quite tedious most of the times. However, if you plan the job search well - you'll figure that you're much at ease with the job application process. Not every Job Search process will lead you the right kind of job. However, if you have taken enough time to plan the process out, you are surely headed the right way. According to a journal article in the <a href=\"https://www.jstor.org/stable/1879403?seq=1#page_scan_tab_contents\" rel=\"nofollow\">Economics of Information and Job Search</a>,  in a labor market characterized by uncertainty, both employers and employees are searching. A <a href=\"https://talent.works/blog\" rel=\"nofollow\">survey</a> states that, despite some challenges in the market, the fact is there’s a pretty significant increase in jobs available now than in previous years — over 200% in certain industries<em>.</em></p>\n",
            "content_html": "<p>A job search can be quite tedious most of the times. However, if you plan the job search well - you'll figure that you're much at ease with the job application process. Not every Job Search process will lead you the right kind of job. However, if you have taken enough time to plan the process out, you are surely headed the right way. According to a journal article in the <a href=\"https://www.jstor.org/stable/1879403?seq=1#page_scan_tab_contents\" rel=\"nofollow\">Economics of Information and Job Search</a>,  in a labor market characterized by uncertainty, both employers and employees are searching. A <a href=\"https://talent.works/blog\" rel=\"nofollow\">survey</a> states that, despite some challenges in the market, the fact is there’s a pretty significant increase in jobs available now than in previous years — over 200% in certain industries<em>.</em></p>\n\n<p>Just follow the simple steps to a Definite Action Plan for your Job Search</p>\n<h2>Know your strengths and weaknesses</h2>\n<p>This point is crucial, not just before planning a job search, but also until you land an interview with any organization. One must be able to identify their strengths and weaknesses at the earlier stage. If your strength lies in excellent communication - you know you'd easily fit into roles like PR, Sales, Trainer. Moreover, identifying your weaknesses before a job search can buy you enough time to build on those weaknesses and convert them into strengths.</p>\n<h2>Start your initial search</h2>\n<p>What exactly would an initial search include? Do you know how to look up jobs on a job portal? Are you well informed about the various jobs that exist on job portals? Are you aware of the right keywords you can use to get the right jobs? One needs to be thorough with the initial homework. An initial homework would include the use of the right keywords, knowledge of the various job portals along with the job postings.</p>\n<p>Moreover, have you studied the market well for the field you've chosen? Do you know the designation that exists for the type of job you're seeking? Hence, an initial search is crucial. It's a virtual peek into the market. Also, it is done to get you familiarised with the type of jobs that exist in the market. Moreover, you get introduced to job descriptions, which state the roles and responsibilities of the candidate an employer is seeking. Don't mess up your initial search, take time out and do it well!</p>\n<h2>Revamp your resume</h2>\n<p>Your resume is your ticket to land a good job. It's simple, if the details on your ticket aren't precise and accurate, you don't get past the boarding gate.  Similarly, your resume needs to state every detail precisely. Do you still hold an outdated resume? Well, then it's time you revamp it.</p>\n<p>If you still think, you can fake a few details on your resume to put up an impressive document - you're wrong. Every detail put on your resume must hold evidence. Update your recent <a href=\"https://guide.makemyresume.co.in/resume-certifications/\">certifications</a>, <a href=\"https://makemyresume.co.in/blog/2018/11/resume-education/\">educational qualifications</a>, <a href=\"https://makemyresume.co.in/blog/2018/11/volunteer-experience-resume/\">volunteer experience</a>, and your previous <a href=\"https://makemyresume.co.in/blog/2018/11/resume-work-experience/\">work experience</a>. Make sure your resume looks fresh.</p>\n<h2>Create a target list of companies</h2>\n<p>We all have that dream list of companies we want to work for. Now is the time you start carving your dream to reality. If you have envisioned working for a particular company, now is the time to make your dreams more realistic. Create a list of companies and make a target list. Put Google to the best use and research about those companies. This extends your knowledge concerning the organization you're targeting, and when you land an interview with the same organization - you're best placed to answer any questions the interviewer throws at you regarding the organization.</p>\n<p>Don't let the interviewer have an impression that you haven't done your homework well. Knowing about the organization you wish to work for will always give you an edge over the other applicants.</p>\n<h2>Create your online presence (LinkedIn)</h2>\n<p>What does a platform like LinkedIn do? Do you think it enhances your job search? Well, LinkedIn is one of the most widely known platforms to explore your job opportunities. LinkedIn connects you to different employers around the globe, where you have the opportunity to explore your choices. If you intend to get noticed by the well-known employers on LinkedIn, it is really important to create an online presence before you venture into the application process.</p>\n<p>Take time out and build your LinkedIn profile. LinkedIn provides you with various sections, where the right amount of information can get you to the right employer. Increase your reach, so when recruiters look up your profile, they aren't spending time browsing - Your profile is out there among the top searches! LinkedIn also provides you with a section to look out for jobs. All you do is enter your preferred designation, for eg: Manager with your preferred location. Do you see how creating an online presence can multiply your chances of getting closer to your dream job?</p>\n<h2><strong>Network online</strong></h2>\n<p><span style=\"font-weight: 400;\">We cannot stress their enough - CONTACTS MATTER. By networking with like-minded individuals, especially if they belong to the same domain, you can demonstrate your capability and competency. Thus, should a vacancy arise in their organization, your network contacts could notify you of the same, and if thoroughly impressed with what they’ve seen of you, potentially even vouch for you, helping you land a more senior role at a better organization. </span><a href=\"https://www.linkedin.com/pulse/power-your-professional-vouch-ronnie-battista/\"><span style=\"font-weight: 400;\">This article</span></a><span style=\"font-weight: 400;\"> explains the power of a professional ‘vouch’ and the impact it can have on your job prospects!</span></p>\n<p><span style=\"font-weight: 400;\">There are various ways and forums you can network professionally, LinkedIn being foremost. To a smaller extent, Facebook and Twitter too can be used for the same. You can even network via popular community forums like Reddit, Pinterest, Quora, etc. Engaging with &amp; producing content of your own via blogs, podcasts, articles, etc. too helps!</span></p>\n<h2><strong>Strengthen your Profile</strong></h2>\n<p><span style=\"font-weight: 400;\">Recruiters today look for more than just academic or professional achievements - they want productive individuals that contribute not just to the organization, but to the society at large too. Employees function as the organizations’ ambassadors, and they want to ensure they’ve got the creme de la creme. Furthermore, they’re interested in hiring candidates that demonstrate a desire to learn and update themselves constantly. It also helps if you have personal extracurricular achievements.</span></p>\n<p><span style=\"font-weight: 400;\">The ideal candidate, thus, would be one with impressive academic (mainly if you’re a fresher) and/or professional achievements, with a few courses and tools under their belt used in the domain they’re applying to, who also actively pursues their hobbies and volunteers at the local NGO.</span></p>\n<p><span style=\"font-weight: 400;\">Take 2 candidates, A &amp; B. </span></p>\n<p><span style=\"font-weight: 400;\">A has 1 year of experience in Social Media Marketing, possesses know-how regarding various tools like Buffer, Quuu &amp; Canva, and recently did a course on Content Strategy from Coursera. A table tennis champ at the local club, they're a member of Sunday Friends and actively participates in at least 1 drive per month. </span></p>\n<p><span style=\"font-weight: 400;\">B has 1 years’ experience in Social Media Marketing, and while their numbers seem as good as A’s, they has done no supplementary courses and they're  only heard of Canva &amp; Buffer, never used them. They've never even heard of Quuu. He spends most of their free time with friends at the local bar playing pool, or binging OTT content. </span></p>\n<p><span style=\"font-weight: 400;\">Despite B being just as competent as A, their profile reflects no upskilling. their knowledge and skillset will become outdated and obsolete soon. Conversely, A is constantly updating their skillset and knowledge base and demonstrated a drive to learn more. They've also contributed to their neighbourhood and people have a high opinion of them. Even though B has not spent their time nefariously, it offers the company no benefit as opposed to having A allied with them - A could contribute to their CSR activities, with the added benefit of having a conscientious individual linked to their brand.</span></p>\n<p><span style=\"font-weight: 400;\">Really want that job you’ve dreamed of? Be like A.</span></p>\n<h2>Recap</h2>\n<ul>\n<li>Know your strengths and weaknesses</li>\n<li>Start your initial search</li>\n<li>Revamp your resume</li>\n<li>Create a target list of companies</li>\n<li>Create your online presence</li>\n<li>Network online</li>\n<li>Strengthen your profile</li>\n</ul>\n<p><em>Image Credit: Unsplash</em></p>",
            "image": "https://guide.makemyresume.co.in/media/posts/53/job-search-plan_e2hyi3-2.jpg",
            "author": {
                "name": "MakeMyResume"
            },
            "tags": [
                   "Job Search"
            ],
            "date_published": "2021-07-01T17:05:00+05:30",
            "date_modified": "2021-07-06T21:06:08+05:30"
        },
        {
            "id": "https://guide.makemyresume.co.in/zoom-job-interview/",
            "url": "https://guide.makemyresume.co.in/zoom-job-interview/",
            "title": "Five Tips To Ace That Zoom Job Interview",
            "summary": "<figure class=\"alignnone wp-image-779\"><img loading=\"lazy\"  title=\"Skype Job Interview\" src=\"https://guide.makemyresume.co.in/media/posts/39/skype-video-call_zdkjmy.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-2xl.jpg 1600w\"  alt=\"Skype job Interview\" width=\"1920\" height=\"1281\"></figure>\n<p>In today’s time, most interviews are Zoom interviews. Companies do this for multiple reasons: the organization has its head office located in another country or another city. Sometimes, due to the candidate unavailability and the urgency to fill in the position, employers immediately conduct a Zoom job interview.</p>\n",
            "content_html": "<figure class=\"alignnone wp-image-779\"><img loading=\"lazy\"  title=\"Skype Job Interview\" src=\"https://guide.makemyresume.co.in/media/posts/39/skype-video-call_zdkjmy.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/39/responsive/skype-video-call_zdkjmy-2xl.jpg 1600w\"  alt=\"Skype job Interview\" width=\"1920\" height=\"1281\"></figure>\n<p>In today’s time, most interviews are Zoom interviews. Companies do this for multiple reasons: the organization has its head office located in another country or another city. Sometimes, due to the candidate unavailability and the urgency to fill in the position, employers immediately conduct a Zoom job interview.</p>\n\n<p>People form first impressions when you meet them in person. However, first impressions can be made rapidly through a Zoom job interview as well. Just to make sure, you are giving your best at the Zoom job interview, follow these quick tips:</p>\n<h3>#1 Make sure you have an uninterrupted internet connectivity</h3>\n<p>The first thing to do before the Zoom call is to check on your internet connectivity. You require a seamless internet connection. An interrupted Zoom interview can have a negative effect and break the link of the interview discussion. So make sure, your internet is connected well and is functioning at a good speed. Use Wi-fi connection instead of the mobile data, since the mobile data often gets interrupted.</p>\n<h3>#2 Appropriately position your laptop or phone</h3>\n<p>Remember, the Zoom job interview isn’t any casual video call with your friend. Thus, it is important to know that you need to set your mobile phone on a stable surface where you are visibly clear. Avoid holding your phone in your hand, since you will end up moving it multiple times and it comes across as highly unprofessional.</p>\n<h3>#3 Use of wired/ wireless headphones</h3>\n<p>During a Zoom job interview, don’t rely on the microphone to communicate. Any possible disruption of the voice and the background sounds can lead to disturbances during the ongoing interview. Get your headphones ready in advance before scheduling the Zoom job interview.</p>\n<h3>#4 Non-Verbal Cues and Body Language</h3>\n<p>A Zoom job interview is nearly similar to a personal interview. Your interviewer can easily capture your body language and <a href=\"https://makemyresume.co.in/blog/2017/10/decoding-non-verbal-cues-interview/\">non-verbal cues</a> through the video. Sit upright, and dress in formal attire. Make sure you are not walking around any corridor during the interview. Treat this as important as equal to a personal interview.</p>\n<h3>#5 Prepare and Request Feedback</h3>\n<p>Prepare well in advance and take a test call a day in advance with a friend. Make all the necessary preparations concerning the equipment as well as to the questions you are likely to counter at the actual interview. You will receive a glimpse of the actual interview. Once you're done with the interview, request feedback from your friend and appropriately make improvements.</p>\n<h2>Recap</h2>\n<p>5 Tips to Ace That Zoom Job Interview</p>\n<ul>\n<li>Make sure you have uninterrupted internet connectivity</li>\n<li>Appropriately position your laptop or phone</li>\n<li>Use wired or wireless earphones</li>\n<li>Non-verbal cues and body language</li>\n<li>Prepare and request feedback</li>\n</ul>\n<p><em>Image Credit: Pixabay</em></p>",
            "image": "https://guide.makemyresume.co.in/media/posts/39/skype-video-call_zdkjmy-lg1.jpg",
            "author": {
                "name": "MakeMyResume"
            },
            "tags": [
                   "Interview Prep"
            ],
            "date_published": "2021-07-01T11:57:00+05:30",
            "date_modified": "2021-07-06T13:57:14+05:30"
        },
        {
            "id": "https://guide.makemyresume.co.in/salary-negotiation-tips/",
            "url": "https://guide.makemyresume.co.in/salary-negotiation-tips/",
            "title": "5 Salary Negotiation Tips - Know How To Negotiate",
            "summary": "<figure class=\"alignnone wp-image-785\"><img loading=\"lazy\"  title=\"Salary Negotiation\" src=\"https://guide.makemyresume.co.in/media/posts/38/302-1140x815_tftreu.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-2xl.jpg 1600w\"  alt=\"Salary Negotiation\" width=\"1140\" height=\"815\"></figure>\n<p>Salary negotiations are one of the most difficult barriers to pass at the time of signing an offer with any organization. Think you’re offered too less? Will you come across as greedy, if you’re asking for a higher salary? How do you prove to the person across the table about your capabilities? Too many thoughts to battle against before actually getting to the negotiation. You have simple 5 negotiation tips to follow that could ease this process.</p>\n",
            "content_html": "<figure class=\"alignnone wp-image-785\"><img loading=\"lazy\"  title=\"Salary Negotiation\" src=\"https://guide.makemyresume.co.in/media/posts/38/302-1140x815_tftreu.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/38/responsive/302-1140x815_tftreu-2xl.jpg 1600w\"  alt=\"Salary Negotiation\" width=\"1140\" height=\"815\"></figure>\n<p>Salary negotiations are one of the most difficult barriers to pass at the time of signing an offer with any organization. Think you’re offered too less? Will you come across as greedy, if you’re asking for a higher salary? How do you prove to the person across the table about your capabilities? Too many thoughts to battle against before actually getting to the negotiation. You have simple 5 negotiation tips to follow that could ease this process.</p>\n\n<h3>Understand benchmarking</h3>\n<p>Your time is valuable and you don’t want to waste it on an organization that isn’t offering what you are worth. This requires you to understand how employees understand their salary levels and thus adjust your job search.</p>\n<p>At the same time, Companies use various benchmarking tools. They compare average pay rates with:</p>\n<ul>\n<li>Pay at other companies in their industry</li>\n<li>The salary for professionals with your level of education and experience</li>\n<li>The income of professionals in your field in their area of the country</li>\n</ul>\n<p>Employers interested in you will offer you the best salary after weighing your competencies. However, understand the benchmarking process and make the right negotiation.</p>\n<h3>Shift focus from past pay to future potential</h3>\n<p>Your future pay package is usually always given in reference to your past pay. When you are at the table talking about your offer – the concerned HR person will give you a hike based on your previous salary. This is a normal process and most organizations follow this. Regardless, there are tactics you can use to have the hiring manager focus on what you can do now and in the future. Take his mind out of the past and let him know your goals and aspirations on the new job.</p>\n<h3>Understand their constraints</h3>\n<p>The organization may like you. They also think you deserve everything. However, when you look at the salary break-up – these intentions are not visible there. Why? You have to understand that every organization sets a budget for an employee. They have constraints and salary caps that no negotiations can break. In such a circumstance, your job is solely to figure out whether they are flexible or not. During a bulk selection, for e.g. Any organization taking in 20 people at the same time, your salary can’t be higher than the other. However, you would have noticed that your organization has been generous and flexible at the start dates, vacations, bonuses and additional incentives.</p>\n<p>It’s better you understand the organization’s constraints before you put forth your proposal. Don’t make any decision without gauging all the problems.</p>\n<h3>Everything counts</h3>\n<p>Remember when you are calculating your salary – don’t get too excited on the whole figure. Usually, employees get happy at the whole figure and forget to calculate the components of the salary. Remember to consider the value of benefits like bonuses, commissions, health insurance, flexible spending accounts, profit-sharing, paid vacation, stock benefits. You have to take into account every component and then make a final proposal.</p>\n<h3>Don’t get emotional – Get Creative</h3>\n<p>Don’t be too focused and emotional about your salary while negotiating. You need to create a certain reputation which doesn’t come across and desperate and greedy. Instead, create a smart image – make the employer feel you have that spark in you, and they are convinced about giving you a higher salary.</p>\n<p>Negotiations don’t need to focus only on the salary structure. Instead, try using creative ways and negotiate on the time period, especially if it’s a contract term. Use creative ways and negotiate on getting a contract of a year instead of 6 months. This can also change the perspective of the employer, and you may just notice your salary get better.</p>\n<p>Remember, the more a company wants you, the more salary negotiation leverage you have.</p>\n<h2>Recap</h2>\n<p>5 Salary Negotiation Tips</p>\n<ul>\n<li>Understand benchmarking</li>\n<li>Shift focus from past pay to future potential</li>\n<li>Understand their constraints</li>\n<li>Everything counts</li>\n<li>Don’t get emotional - get creative</li>\n</ul>\n<p><em>Image: <a href=\"https://www.freepik.com/premium-photo/hand-businessman-giving-dollars-cash-money-to-hand-man-with-corruption-concept_2086480.htm#term=salary&amp;page=1&amp;position=6\" rel=\"nofollow\">Freepik</a></em></p>",
            "image": "https://guide.makemyresume.co.in/media/posts/38/302-1140x815_tftreu-lg1.jpg",
            "author": {
                "name": "MakeMyResume"
            },
            "tags": [
                   "Job Search"
            ],
            "date_published": "2021-07-01T11:45:00+05:30",
            "date_modified": "2021-07-06T13:55:30+05:30"
        },
        {
            "id": "https://guide.makemyresume.co.in/thank-you-letters-job-interviews/",
            "url": "https://guide.makemyresume.co.in/thank-you-letters-job-interviews/",
            "title": "Thank You Letters and Job Interviews",
            "summary": "<figure class=\"alignnone wp-image-464\"><img loading=\"lazy\"  title=\"Thank You Letters\" src=\"https://guide.makemyresume.co.in/media/posts/25/thank-you-letters_pim31m-1.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-2xl.jpg 1600w\"  alt=\"Thank You Letters\" width=\"4641\" height=\"3094\"></figure>\n<p><strong>“Thank you”</strong>- It’s amazing how these two simple words that mean so much can seem so little. <strong>T</strong><strong>hank you letters</strong> or even a trivial message can go a long way in helping you show your appreciation. And with that come several perks, in addition to providing a boost to your career. In the words of Simon Mainwaring –</p>\n<blockquote>“<em>The simple act of saying<strong> ‘thank you’</strong> is a demonstration of gratitude in response to an experience that was meaningful to a customer of citizen.”</em></blockquote>\n<p>And going by that, it can be said that <strong>thank you letters</strong> can definitely help you cement a good relationship with clients, vendors or even in getting an eventual job offer. So, let us talk about <strong>thank you letters</strong> - more importantly, how they are of help in job interviews.</p>\n",
            "content_html": "<figure class=\"alignnone wp-image-464\"><img loading=\"lazy\"  title=\"Thank You Letters\" src=\"https://guide.makemyresume.co.in/media/posts/25/thank-you-letters_pim31m-1.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/25/responsive/thank-you-letters_pim31m-1-2xl.jpg 1600w\"  alt=\"Thank You Letters\" width=\"4641\" height=\"3094\"></figure>\n<p><strong>“Thank you”</strong>- It’s amazing how these two simple words that mean so much can seem so little. <strong>T</strong><strong>hank you letters</strong> or even a trivial message can go a long way in helping you show your appreciation. And with that come several perks, in addition to providing a boost to your career. In the words of Simon Mainwaring –</p>\n<blockquote>“<em>The simple act of saying<strong> ‘thank you’</strong> is a demonstration of gratitude in response to an experience that was meaningful to a customer of citizen.”</em></blockquote>\n<p>And going by that, it can be said that <strong>thank you letters</strong> can definitely help you cement a good relationship with clients, vendors or even in getting an eventual job offer. So, let us talk about <strong>thank you letters</strong> - more importantly, how they are of help in job interviews.</p>\n\n<h3>Thank-you letters for job interviews</h3>\n<p>One might ask- <em>\"How do<strong> thank-you letters</strong> help in case of <a href=\"https://guide.makemyresume.co.in/selling-yourself-effectively-interview/\">job interviews</a>?\" </em>Well, to answer in a practical way, it is courteous to do that. It is actually important to say thank you to an employer after an interview - it helps to reiterate your views to the employers as to how the job interests you. More importantly, <strong>thank-you letters </strong>help to highlight you in a better light <em>(even if your <a href=\"https://guide.makemyresume.co.in/interview-doand039s-and-donand039ts/\">interview did not go according to plan</a>)</em> and entrench your position as the best suitable candidate.</p>\n<h3>How to write thank you letters - helpful tips</h3>\n<p>Now that we know the importance of <strong>thank you letters</strong>, let's talk about how to write one in the first place.<strong> Thank you letters</strong> should help you thank everyone - from recruiters to everyone who assisted in your job search. Here are some basic points that you should keep in mind while writing <strong>thank you letters</strong> -</p>\n<ul>\n<li><strong>Knowing who to address the thank you letters to</strong></li>\n<li><strong>It is all about making an impact and standing out</strong></li>\n<li><strong>Take measures to keep it short and simple</strong></li>\n<li><strong>Proofread and spellcheck the thank you letter</strong></li>\n<li><strong>Lastly, remember to actually write the words <em>\"thank you\"</em> </strong></li>\n</ul>\n<p>Writing <strong>thank you letters</strong> can oftentimes be the key to getting a job offer. In these days of email and online communication, taking the time out to thank your potential employers can <em>(more than anything else)</em> emphasize the fact that you are a well-mannered person. Other than that, it can also reinforce the fact that you want the job. Use your <strong>thank you letter</strong> to address any issues and concerns that came up during the interview. Try to discuss anything of importance that the interviewer might have neglected to ask. And while doing that, restate as to why you want the job, what your qualifications are, how you might be able to contribute positively towards the organisation.</p>\n<p>So, the next time you apply for a job - remember to write a <strong>thank you letter</strong>. And as Alfred Painter had once mentioned -</p>\n<blockquote>\n<p style=\"text-align: center;\"><em>\"Saying 'thank you' is more than good manners. It is good spirituality\"</em></p>\n</blockquote>\n<p><em>Photo by <a href=\"https://unsplash.com/photos/0YbeoQOX89k?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" rel=\"nofollow\">Hanny Naibaho</a> on <a href=\"https://unsplash.com/search/photos/thank-you?utm_source=unsplash&amp;utm_medium=referral&amp;utm_content=creditCopyText\" rel=\"nofollow\">Unsplash</a></em></p>",
            "image": "https://guide.makemyresume.co.in/media/posts/25/thank-you-letters_pim31m-1-lg1.jpg",
            "author": {
                "name": "MakeMyResume"
            },
            "tags": [
                   "Letters"
            ],
            "date_published": "2021-06-15T11:30:00+05:30",
            "date_modified": "2021-07-06T13:54:02+05:30"
        },
        {
            "id": "https://guide.makemyresume.co.in/decoding-non-verbal-cues-interview/",
            "url": "https://guide.makemyresume.co.in/decoding-non-verbal-cues-interview/",
            "title": "Decoding Non-Verbal Cues In An Interview",
            "summary": "<p><img loading=\"lazy\" src=\"https://images.unsplash.com/photo-1517048676732-d65bc937f952?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&amp;ixlib=rb-1.2.1&amp;auto=format&amp;fit=crop&amp;w=1000&amp;q=80\" data-is-external-image=\"true\"  alt=\"people sitting on chair in front of table while holding pens during daytime\"></p>\n<p>They say that answering all the questions while <a href=\"https://makemyresume.co.in/blog/2017/07/selling-yourself-effectively-interview/\">effectively selling yourself in the interview</a> can fetch you the job. But little do people know that merely answering the questions is never enough to get you hired. And this applies to Zoom interview as much as in-person interviews.</p>\n<p>While it is imperative to articulate properly, an interview comprises of several other aspects as well which can make a world of a difference between pass and fail. And this is where non-verbal cues come into the picture.</p>\n",
            "content_html": "<p><img loading=\"lazy\" src=\"https://images.unsplash.com/photo-1517048676732-d65bc937f952?ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&amp;ixlib=rb-1.2.1&amp;auto=format&amp;fit=crop&amp;w=1000&amp;q=80\" data-is-external-image=\"true\"  alt=\"people sitting on chair in front of table while holding pens during daytime\"></p>\n<p>They say that answering all the questions while <a href=\"https://makemyresume.co.in/blog/2017/07/selling-yourself-effectively-interview/\">effectively selling yourself in the interview</a> can fetch you the job. But little do people know that merely answering the questions is never enough to get you hired. And this applies to Zoom interview as much as in-person interviews.</p>\n<p>While it is imperative to articulate properly, an interview comprises of several other aspects as well which can make a world of a difference between pass and fail. And this is where non-verbal cues come into the picture.</p>\n\n<p>According to a study conducted by <em>College Journal</em>, <strong>interviews constitute 55% of body language, 7% verbal communication and 38% paralanguage.</strong> These statistics prove that <strong>non-verbal communication is not just essential, but exceptionally vital to ace the process.</strong></p>\n<p>Actions speak louder than words. This anthem rings well in the interview scenario too. You tend to make a non-verbal impression right from the moment you enter your interview office. The interviewer makes his first judgment even before you get to say a word.  Hence, it is to the applicant's advantage to grasp the fundamentals of non-verbal cues for ultimate success.</p>\n<h5>Non-verbal cues:</h5>\n<ul>\n<li>Give a glimpse of the emotional state of an applicant</li>\n<li>Regulate the flow of communication</li>\n<li>Reinforce verbal communication</li>\n<li>Define the relationship between the applicant and the interviewer</li>\n</ul>\n<p>Sometimes even the most qualified candidates do not make a cut due to their behavior or body language. Such mistakes can ruin your chances of getting the job. Therefore it is imperative to understand the various components of non-verbal communication -</p>\n<h2>Body language</h2>\n<figure class=\"alignnone size-large wp-image-298\"><img loading=\"lazy\"  src=\"https://guide.makemyresume.co.in/media/posts/11/3719.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/11/responsive/3719-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/11/responsive/3719-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/11/responsive/3719-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/11/responsive/3719-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/11/responsive/3719-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/11/responsive/3719-2xl.jpg 1600w\"  alt=\"Non-verbal cues\" width=\"700\" height=\"467\"></figure>\n<p>Body language forms an indispensable part of non-verbal communication as it strengthens an individual's articulation while giving a peek into their attitude and emotions. It constitutes your posture, gestures, head and hand movements and an overall presence of your body.</p>\n<p>It is not an exaggeration to say that your body language communicates more to the other person than what you say or the tone of your voice. For this reason, your body language has a large effect on the recruiter's perceptions of you and hence your likelihood of being hired.</p>\n<p>Let us see a few hacks that help you get through this phase like a pro:</p>\n<ul>\n<li><strong>Arrival: </strong>Walk confidently into the interview cabin, greet your hiring manager, make an eye contact, smile and give a confident handshake. This is where you make your first impression.</li>\n<li><strong>Posture: </strong>As you take your seat, make sure to sit up straight yet in a relaxed way where your shoulders drop naturally. <em>Do not lean back or fidget as it might make you look lethargic or immature.</em> The goal is to appear confident and enthusiastic.</li>\n<li><strong>Angles: </strong>Shoulders should be directed towards the hiring manager to indicate openness.</li>\n<li><strong>Leaning: </strong>Don't be a statue or lean-in too aggressively, you might end up invading the interviewer's personal space. Lean in naturally when appropriate but make sure to return to your original sitting position.</li>\n<li><strong>Hands and Feet: </strong>Keep your feet flat on the floor and hands in a neutral state unless speaking. Practice a few comfortable poses before the interview which make you look like relaxed and engaged.  Let your hands be in a neutral position unless you're speaking. <em>Never fold your arms in an interview. It substantially reduces your credibility.</em></li>\n<li>Keep your gesticulation natural and moderate.</li>\n</ul>\n<h2>Eye Movements</h2>\n<figure class=\"alignnone size-large wp-image-299\"><img loading=\"lazy\"  src=\"https://guide.makemyresume.co.in/media/posts/11/O5MC2X0.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/11/responsive/O5MC2X0-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/11/responsive/O5MC2X0-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/11/responsive/O5MC2X0-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/11/responsive/O5MC2X0-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/11/responsive/O5MC2X0-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/11/responsive/O5MC2X0-2xl.jpg 1600w\"  alt=\"Eye contact\" width=\"700\" height=\"467\"></figure>\n<p>Eyes never lie. Eye movements act like a sneak-peek into one's soul and are often inclined to reveal information unintentionally. Proper eye contact can make or break your efforts of landing the job. Frequency of eye contact, blink rate, and pupil dilation are all a part of eye movements, which, if paid attention can be of immense help in an interview.</p>\n<ul>\n<li><strong>Maintaining eye contact indicates interest</strong> and is also a major source of feedback. You can always understand the interviewer's interest in you through his frequency of eye contact.</li>\n<li>Making eye contact is important. But it is even more important to <strong>avoid over-doing it. </strong>Too much of eye contact is not just bad, it is worse than minimal eye contact.</li>\n<li>A well-known trick here is to <strong>look long enough to register the eye color</strong> of the interviewer before looking away.</li>\n<li>If you find it difficult to look straight into the eyes of the hiring manager, here's a hack - <strong>draw an imaginary triangle around the other person's eyes and mouth.</strong> Shift your glance every five seconds to different points of this triangle. This way you'll look interested and engrossed in the conversation.</li>\n<li><strong>Maintain a stable blink rate</strong>. While too much of blinking could mean that you're stressed or are lying, minimal blink rate makes it creepy and forced.</li>\n<li>A firm gaze with a steady blink rate cultivates relationships and forms a bridge between listening and speaking.</li>\n</ul>\n<h2>Voice Modulation</h2>\n<figure class=\"alignnone size-large wp-image-300\"><img loading=\"lazy\"  src=\"https://guide.makemyresume.co.in/media/posts/11/O72JJ60.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/11/responsive/O72JJ60-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/11/responsive/O72JJ60-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/11/responsive/O72JJ60-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/11/responsive/O72JJ60-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/11/responsive/O72JJ60-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/11/responsive/O72JJ60-2xl.jpg 1600w\"  alt=\"Voice Modulation\" width=\"700\" height=\"467\"></figure>\n<p>A large part of the impression you make in an interview comes from vocal delivery, not what you say, but how you say that. Your voice delivery can hugely influence your perceived confidence and competence. Voice modulation helps in judging your situational temperament and is an excellent way to communicate your passion for the job.</p>\n<ul>\n<li>Make sure to keep your speech smooth and warm. The interviewer should find you friendly and approachable.</li>\n<li><strong>Try to match up to your interviewer's pace and speaking volume</strong>. Emulating your speaking partner is the most effective way to promote a healthy communication.</li>\n<li><strong>Pay attention to your intonation, rhythm, and pronunciation. </strong></li>\n<li><strong>Always be aware of the volume and speed of your message delivery.</strong> Express your ideas in short and simple sentences and pause briefly to let the message sink in.</li>\n<li><strong>Never use words like <em>um, er, uh - huh, like, you know</em> etc.</strong></li>\n<li><strong>Complete every thought you set out to express.</strong> Expressing complete thoughts indicates confidence in your ideas and the ability to bring them to a conclusion.</li>\n</ul>\n<h2>Tips to impress</h2>\n<p>Admit it! No matter how much ever we discuss non-verbal cues, it is difficult to practice it in real-time. But here are a few hacks to recede your nervousness and put up a great show in your interview :</p>\n<h5>Before the interview</h5>\n<ul>\n<li>Dress appropriately for an interview - wear an outfit that is both formal and contemporary. No bright colors. Plan for it a few days before. Ensure it is well-fitting, cleaned and pressed.</li>\n<li>Don't forget the little things - shine your shoes, check for loose hems and make sure your nails are trimmed and clean.</li>\n<li>Tone down the bling when it comes to jewelry, makeup and especially fragrance.</li>\n<li>Keep your stray hair in check. It is a massive turn-off if a candidate's face is shadowed by tufts of hair.</li>\n<li>Ensure that your tattoos and piercings are well hidden.</li>\n<li>Bring several copies of <a href=\"https://guide.makemyresume.co.in/resume-writing-tips/\">your resume</a> to the interview. You can also bring your work samples and portfolio, if appropriate. But make sure they are all organized professionally.</li>\n<li>Learn about the organization. Research about the company through their website and understand their objective behind establishing the company.</li>\n</ul>\n<h5>During the interview</h5>\n<ul>\n<li>Make sure that your handshake is firm, but not bone-crushing.</li>\n<li>Never chew a gum before the hiring panel. It is plain rude and disrespectful.</li>\n<li>Do not bring your cell phone, iPod or any other gadgets to the venue.</li>\n<li>Listen. Be attentive and pay attention to detail.</li>\n<li>Avoid any negative comments. Be positive in narrating your experience.</li>\n<li>Do not move your hands wildly while enunciating.</li>\n<li>Do not fidget, tap your feet, drum your fingers or keep touching your hands and face incessantly.</li>\n<li>Never interrupt the hiring manager.</li>\n<li>Never degrade or speak ill of your previous employer. This is extremely important.</li>\n<li><a href=\"https://guide.makemyresume.co.in/16-questions-to-ask-at-the-end-of-the-interview/\">Prepare some interesting questions to ask the hiring manager.</a></li>\n<li>Always thank the interviewer for his time and patience before finishing the interview.</li>\n</ul>\n<p>Remember, at the end of the day, an interview is also a conversation. If you prepare right and exude professionalism through your body language, you've already aced that interview!</p>\n<p><em>Image Credits: <a href=\"http://freepik.com\" rel=\"nofollow\">Freepik.com</a></em></p>",
            "image": "https://guide.makemyresume.co.in/media/posts/11/photo-1517048676732-d65bc937f9521",
            "author": {
                "name": "MakeMyResume"
            },
            "tags": [
                   "Interview Prep"
            ],
            "date_published": "2021-06-09T18:37:00+05:30",
            "date_modified": "2021-07-06T13:52:54+05:30"
        },
        {
            "id": "https://guide.makemyresume.co.in/infographic-need-great-resume/",
            "url": "https://guide.makemyresume.co.in/infographic-need-great-resume/",
            "title": "INFOGRAPHIC: Here&#x27;s Why You need a Great Resume",
            "summary": "<h2><figure class=\"alignnone wp-image-575\"><img loading=\"lazy\"  title=\"Resume Infographic Feature\" src=\"https://guide.makemyresume.co.in/media/posts/31/Resume_Infographic_Feature_Image_xokuah-1.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-xs.png 300w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-sm.png 480w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-md.png 768w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-lg.png 1024w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-xl.png 1360w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-2xl.png 1600w\"  alt=\"Resume Infographic Feature\" width=\"940\" height=\"788\"></figure></h2>\n<h2>Resume Infographic</h2>\n<p>Here's why you need a great resume!</p>\n",
            "content_html": "<h2><figure class=\"alignnone wp-image-575\"><img loading=\"lazy\"  title=\"Resume Infographic Feature\" src=\"https://guide.makemyresume.co.in/media/posts/31/Resume_Infographic_Feature_Image_xokuah-1.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-xs.png 300w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-sm.png 480w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-md.png 768w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-lg.png 1024w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-xl.png 1360w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Resume_Infographic_Feature_Image_xokuah-1-2xl.png 1600w\"  alt=\"Resume Infographic Feature\" width=\"940\" height=\"788\"></figure></h2>\n<h2>Resume Infographic</h2>\n<p>Here's why you need a great resume!</p>\n\n<h3><figure class=\"alignnone wp-image-572\"><img loading=\"lazy\"  title=\"Resume Infographic\" src=\"https://guide.makemyresume.co.in/media/posts/31/Great_Resume_Infographic_bflvfg.png\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/31/responsive/Great_Resume_Infographic_bflvfg-xs.png 300w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Great_Resume_Infographic_bflvfg-sm.png 480w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Great_Resume_Infographic_bflvfg-md.png 768w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Great_Resume_Infographic_bflvfg-lg.png 1024w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Great_Resume_Infographic_bflvfg-xl.png 1360w ,https://guide.makemyresume.co.in/media/posts/31/responsive/Great_Resume_Infographic_bflvfg-2xl.png 1600w\"  alt=\"Resume Infographic\" width=\"800\" height=\"2000\"></figure></h3>\n<h3>30 seconds is the time spent by the recruiter on your resume</h3>\n<p>Research indicates that only 6 to 30 secs are spent on the first scan. The Content and Presentation has to make the <a href=\"https://guide.makemyresume.co.in/resume-writing-tips/\">most of this limited time</a>.</p>\n<h3>1/20 applications make it through to the interview shortlist</h3>\n<p>Out of 100 applications, 20-25 make it to the hiring manager, and out of that 4-6 get shortlisted for the interview.</p>\n<h3>Get more interview calls to shorten the job search cycle</h3>\n<p>Depending on your years of experience, it can take anytime between 1 month to 6 months to find a new job. Don’t go unprepared for the interview, read up on our <a href=\"https://guide.makemyresume.co.in/selling-yourself-effectively-interview/\">insightful tips on interviews</a>.</p>\n<p><em>References:</em></p>\n<p><em>1. The Ladders <a href=\"https://www.theladders.com/career-advice/you-only-get-6-seconds-of-fame-make-it-count\" rel=\"nofollow\">https://www.theladders.com/career-advice/you-only-get-6-seconds-of-fame-make-it-count</a></em></p>\n<p><em>2. Ere <a href=\"https://www.ere.net/why-you-cant-get-a-job-recruiting-explained-by-the-numbers/\" rel=\"nofollow\">https://www.ere.net/why-you-cant-get-a-job-recruiting-explained-by-the-numbers/ </a></em> <em>3. The Guardian <a href=\"https://jobs.theguardian.com/article/does-your-cv-pass-the-30-second-speed-test-/\" rel=\"nofollow\">https://jobs.theguardian.com/article/does-your-cv-pass-the-30-second-speed-test-/</a> </em></p>\n<p><em>4. Monster <a href=\"https://www.monster.com/career-advice/article/how-long-does-it-take-to-get-a-job-0117\" rel=\"nofollow\">https://www.monster.com/career-advice/article/how-long-does-it-take-to-get-a-job-0117</a></em></p>",
            "image": "https://guide.makemyresume.co.in/media/posts/31/Resume_Infographic_Feature_Image_xokuah-1-lg1.png",
            "author": {
                "name": "MakeMyResume"
            },
            "tags": [
                   "Resume"
            ],
            "date_published": "2021-05-09T11:32:00+05:30",
            "date_modified": "2021-07-06T13:50:50+05:30"
        },
        {
            "id": "https://guide.makemyresume.co.in/cover-letters/",
            "url": "https://guide.makemyresume.co.in/cover-letters/",
            "title": "What Makes a Good Cover Letter?",
            "summary": "<figure class=\"alignnone wp-image-351\"><img loading=\"lazy\"  title=\"cover_letter\" src=\"https://guide.makemyresume.co.in/media/posts/13/2092-min_qgkvcv-1-scaled.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-2xl.jpg 1600w\"  alt=\"Cover Letter\" width=\"5554\" height=\"3703\"></figure>\n<p>With increased competitiveness in today’s job market, the onus to “market” oneself has become all the more necessary. And to create such a good first impression, <strong>cover letters</strong> are the most important tool<em> (literally)</em> to have in one’s arsenal.</p>\n<p>A <strong>cover letter</strong>, coupled with <a href=\"#non-existing-post-with-id-14\">a resume</a>, helps to provide additional information about the applicant’s skills and experience.  More specifically, it provides the information that is not mentioned on the resume.</p>\n",
            "content_html": "<figure class=\"alignnone wp-image-351\"><img loading=\"lazy\"  title=\"cover_letter\" src=\"https://guide.makemyresume.co.in/media/posts/13/2092-min_qgkvcv-1-scaled.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/13/responsive/2092-min_qgkvcv-1-scaled-2xl.jpg 1600w\"  alt=\"Cover Letter\" width=\"5554\" height=\"3703\"></figure>\n<p>With increased competitiveness in today’s job market, the onus to “market” oneself has become all the more necessary. And to create such a good first impression, <strong>cover letters</strong> are the most important tool<em> (literally)</em> to have in one’s arsenal.</p>\n<p>A <strong>cover letter</strong>, coupled with <a href=\"https://guide.makemyresume.co.in/why-do-you-need-a-great-resume/\">a resume</a>, helps to provide additional information about the applicant’s skills and experience.  More specifically, it provides the information that is not mentioned on the resume.</p>\n\n<p>Think of it as trying to sell a product – that product being you. <em>(99% of the applicants write 'hardworking' 'smart'and 'enthusiastic'.</em> Do you really want to sound as generic as that?). </p>\n<p><strong>Cover letters</strong> and resumes are often the first information a potential employer receives about an applicant. Knowing about the different types of <strong>cover letters</strong> can thus help you paint a stellar image of your competence, motivation, and experience in front of the potential employers.</p>\n<p>It is always advisable to highlight oneself flatteringly in their <strong>cover letters. </strong>And that can either be by basking in reflected glory <em>(such as associations with prestigious institutions) </em>or self-presentation<em> (listing reasons why they are better than others)</em>.</p>\n<p><a href=\"https://www.researchgate.net/profile/Robert_Giacalone/publication/226194840_Impression_management_in_the_resume_and_cover_letter/links/00b49532dc81953f35000000.pdf\"><strong>Cover letters</strong> are of three types,</a> each with their individual pros and cons - but that discussion is for another day. Let us, instead talk about cover letters in themselves, and how to write a great one, thereby helping you land a job at your dream company.</p>\n<blockquote><em><strong>\"Cover letters</strong> should complement, not mirror your resume. Its purpose is to interpret the factual resume and add a personal touch to your application for employment.\"</em></blockquote>\n<h3>Cover letters - What makes for a great cover letter?</h3>\n<p><strong>Cover letters</strong> should complement, not mirror your resume. Its purpose is to interpret the factual resume and add a personal touch to your application for employment.</p>\n<p><em> Imagine writing a great cover letter, which highlights all of your achievements and skills, but failing to notice the tiniest bit of typing error made in it.</em> <em>How will that present you in the eyes of the employer</em><em>?</em></p>\n<p>In the worst case scenario, your application would probably be rejected by them. Always remember that a <strong>cover letter</strong> is often your earliest written contact with a potential employer. They help to create a critical first impression. And so, even the tiniest bit of error casts doubt on your efficiency and attention to details.</p>\n<p>Secondly, Imagine writing an error-free <strong>cover letter, </strong>but instead filling it up with generic details. That makes you sound just like the rest in relation to skills and attributes. And employers may find it difficult to select you. That is why it is important to write in such a way that it makes you sound less generic and helps you stand out from the rest of the crowd.</p>\n<h3>Conclusion</h3>\n<p>Cover letters help explain the reasons for your interest in the specific organization. When written effectively, they lend support in identifying your most relevant skills or experiences. But one thing to keep in mind is to keep the letter focused, concise, and a few paragraphs in length - enough to entice the recruiter to contact you for an<a href=\"https://guide.makemyresume.co.in/selling-yourself-effectively-interview/\"> interview</a>. </p>\n<p> </p>\n<p><em>Image Credit: Freepik</em></p>",
            "image": "https://guide.makemyresume.co.in/media/posts/13/2092-min_qgkvcv-1-scaled-lg1.jpg",
            "author": {
                "name": "MakeMyResume"
            },
            "tags": [
                   "Letters"
            ],
            "date_published": "2021-04-27T10:02:00+05:30",
            "date_modified": "2021-07-06T13:49:02+05:30"
        },
        {
            "id": "https://guide.makemyresume.co.in/16-questions-to-ask-at-the-end-of-the-interview/",
            "url": "https://guide.makemyresume.co.in/16-questions-to-ask-at-the-end-of-the-interview/",
            "title": "16 Questions To Ask At The End Of The Interview",
            "summary": "<div class=\"page\" title=\"Page 15\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<figure class=\"alignnone wp-image-72\"><img loading=\"lazy\"  title=\"End of Interview Questions\" src=\"https://guide.makemyresume.co.in/media/posts/3/questions_-_Article_4_idlkqf.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-2xl.jpg 1600w\"  alt=\"End of Interview Questions\" width=\"2994\" height=\"2993\"></figure>\n<p>As much as it is for the interviewer to see you as a fitting candidate for the role, it is important for <em>you </em>to assess whether you want to take up the role.</p>\n<p>Asking smart, well thought out questions at the end of the interview is always a good thing to do. It gives you the opportunity to clear your doubts about the company and the position, and also projects you as genuinely interested in the job.</p>\n</div>\n</div>\n</div>\n</div>\n",
            "content_html": "<div class=\"page\" title=\"Page 15\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<figure class=\"alignnone wp-image-72\"><img loading=\"lazy\"  title=\"End of Interview Questions\" src=\"https://guide.makemyresume.co.in/media/posts/3/questions_-_Article_4_idlkqf.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/3/responsive/questions_-_Article_4_idlkqf-2xl.jpg 1600w\"  alt=\"End of Interview Questions\" width=\"2994\" height=\"2993\"></figure>\n<p>As much as it is for the interviewer to see you as a fitting candidate for the role, it is important for <em>you </em>to assess whether you want to take up the role.</p>\n<p>Asking smart, well thought out questions at the end of the interview is always a good thing to do. It gives you the opportunity to clear your doubts about the company and the position, and also projects you as genuinely interested in the job.</p>\n</div>\n</div>\n</div>\n</div>\n\n<div class=\"page\" title=\"Page 16\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<p>Before going for the interview, research about the company and prepare a set of questions you would want to get insight about:</p>\n<h3>1. Know about the role and the position</h3>\n<p>You don’t want to accept a job only to regret later. Ask questions that help you make an educated decision. Some questions that you may want to ask:</p>\n<ul>\n<li>If you decide to go ahead and hire me, what would a typical work day look like for me?</li>\n<li>What personality traits do you think are necessary to succeed in this role?</li>\n<li>What challenges am I likely to face during the course of this position?</li>\n<li>Who will I be reporting to? Where does the person fall in the hierarchy of the company?</li>\n<li style=\"text-align: left;\">What has been the career progression of people in this position?</li>\n</ul>\n<h3>2. Understand the beliefs of the company:</h3>\n<p>You should see yourself as a good match to the culture, beliefs, and values of the company. Both, you and the company, should be glad to have each other, like a happy couple!</p>\n<ul>\n<li>How would you define the culture of the company?</li>\n<li>What values does the company stand by? How do you ensure they are embedded in day to day activities and long term goals?</li>\n<li>How do you resolve conflicts in the company?</li>\n<li>Who do you consider your competition? How do you rate yourself against them?</li>\n<li>What do you consider as the best part about working for this company?</li>\n<li>Do you consider the company to be people oriented or process oriented?</li>\n<li>How will the company help me grow?</li>\n<li>What constitutes success in the company?</li>\n</ul>\n</div>\n</div>\n</div>\n</div>\n<div class=\"page\" title=\"Page 17\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<h3>3. Be aware of the selection process</h3>\n<ul>\n<li>Do you have any reservations about my qualifications?</li>\n<li>Can I provide you with anything else to make your decision simpler?</li>\n<li>What are next steps? By when can I expect a decision from your team?</li>\n</ul>\n<p>These are the common parameters that are likely to impact your decision, and the probability of you being successful in the role.</p>\n<p>Concerns though, will vary for each individual and you may want to know other aspects to have deeper understanding of what lies ahead.</p>\n<h4>Key Takeaways:</h4>\n<ul>\n<li>It is imperative to ask questions that will help you make an informed decision about taking up the job</li>\n<li>It’s good to voice your concerns and reservations. Don’t feel intimidated</li>\n<li>Asking questions also demonstrates your interest in the job and the company</li>\n</ul>\n</div>\n</div>\n</div>\n</div>",
            "image": "https://guide.makemyresume.co.in/media/posts/3/questions_-_Article_4_idlkqf-lg1.jpg",
            "author": {
                "name": "MakeMyResume"
            },
            "tags": [
                   "Interview Prep"
            ],
            "date_published": "2021-03-20T16:00:00+05:30",
            "date_modified": "2021-07-06T13:44:20+05:30"
        },
        {
            "id": "https://guide.makemyresume.co.in/selling-yourself-effectively-interview/",
            "url": "https://guide.makemyresume.co.in/selling-yourself-effectively-interview/",
            "title": "Selling Yourself Effectively in an Interview",
            "summary": "<figure class=\"alignnone wp-image-117 size-large\"><img loading=\"lazy\"  src=\"https://guide.makemyresume.co.in/media/posts/5/nik-macmillan-280300-1.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-2xl.jpg 1600w\"  alt=\"job-interview\" width=\"700\" height=\"467\"></figure>\n<p>A <a href=\"#non-existing-post-with-id-14\">good resume</a> will get you called in for an interview. But it's the interview that can fetch you the job. An interview is not just a conversation to discuss a potential opportunity with a prospective employer –<strong><em> it's also about positioning yourself for the job. </em></strong></p>\n<p>So, how to get that right? How to demonstrate that you stand apart from the competition?</p>\n<p>It's by honing this skill of <strong><em>“Selling yourself!”. </em></strong></p>\n",
            "content_html": "<figure class=\"alignnone wp-image-117 size-large\"><img loading=\"lazy\"  src=\"https://guide.makemyresume.co.in/media/posts/5/nik-macmillan-280300-1.jpg\" sizes=\"(max-width: 48em) 100vw, 768px\" srcset=\"https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-xs.jpg 300w ,https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-sm.jpg 480w ,https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-md.jpg 768w ,https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-lg.jpg 1024w ,https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-xl.jpg 1360w ,https://guide.makemyresume.co.in/media/posts/5/responsive/nik-macmillan-280300-1-2xl.jpg 1600w\"  alt=\"job-interview\" width=\"700\" height=\"467\"></figure>\n<p>A <a href=\"https://guide.makemyresume.co.in/why-do-you-need-a-great-resume/\">good resume</a> will get you called in for an interview. But it's the interview that can fetch you the job. An interview is not just a conversation to discuss a potential opportunity with a prospective employer –<strong><em> it's also about positioning yourself for the job. </em></strong></p>\n<p>So, how to get that right? How to demonstrate that you stand apart from the competition?</p>\n<p>It's by honing this skill of <strong><em>“Selling yourself!”. </em></strong></p>\n\n<p>A job interview is unlike any other form of interaction. The interviewer wants you to talk about how you’ll be the best fit for the job. Their job is to pick the best candidate.</p>\n<p>But it's difficult to get a wholesome idea about the candidate in a 25-30 minute interview, so he relies on limited data – <strong>what you tell them in the interview</strong>.</p>\n<p>Selling yourself doesn’t mean deception – it's about <strong>identifying your key accomplishments and communicating them in a concise and compelling way!</strong></p>\n<p>Now that we know what to do in an interview, let us check out how exactly it can be done.</p>\n<h3><strong>Analyze</strong></h3>\n<p>Think of it as a marketing challenge. The key is to market yourself appropriately as well as adequately.</p>\n<p>Take a good look at the job description. What makes you a great match? What are the skills that you can bring to the table? Can you show some key accomplishments or expertise that separates you from the pack?</p>\n<p><strong>Understand what the employer is looking for and <u>analyze</u> how you’ll specifically fit those needs.</strong></p>\n<h3><strong>Hone your speaking points</strong></h3>\n<p>Your analysis will now give you a clear picture of the key selling points your prospective employer would be most interested in. Now it’s time reframe these points so that you can communicate them effectively and powerfully!</p>\n<p>it's useful to do some preparation around what you want to say and how do you want to say that. Think about the approach and language that will be most natural for you – that will still feel like You, just more confident and articulate about your key strengths.</p>\n<p><strong>Take a notepad and list your top-selling points</strong>. When you walk out, what should the interviewer remember about you? Think about it. Aim for at least five crucial points – your areas of expertise, education, key accomplishments, soft skills and/or other strengths.</p>\n<p><strong>For each of these points, write a proof statement</strong>. This proof statement should be a demonstration of your key strengths in the past.</p>\n<p>For example, for a management role, you’ll demonstrate that you’ve successfully led a team.</p>\n<p><strong>Proof Statement 1:</strong></p>\n<blockquote><em>\"</em>In my current role, I started as a team member and went on to become the manager and built a team of my own. Now my team consists of about 10 people and is recognized as the most productive team in the company. Now all the new joiners are sent to me to mentor! <em>”</em></blockquote>\n<p>This statement proves that this guy has built a team themself and now is mentoring junior coaches as well. Clearly, this stands as a supplement to their statement of being a good manager.</p>\n<p>Also, many candidates claim that they are “hard workers” in an interview. Although a strong work ethic is a great asset and is desirable for almost any position, keep in mind that interviewers hear this a lot and may not see this as a key differentiator. If you choose to keep this as one of your selling points (which most candidates often do), then it's vital to amplify this with a proof statement again.</p>\n<p>For example,</p>\n<p><strong>Proof Statement 2:</strong></p>\n<blockquote>“<em>In my previous role, I had to wear several hats since it was a startup and we were running short on staff.</em> At a point of time, I managed all the activities related to content marketing – be it writing blogs, social media marketing, developing the website’s content alongside many others. But it turned out to be a huge success eventually, with an increase in the traction to our website and blog. There was an appreciation from all over!”</blockquote>\n<p>Notice that this example not only personifies the candidate’s hard working ability but also projects one more selling point – <em>being a great content writer</em>! This is a canny way of handling the question, and it works the best!</p>\n<h3><strong>Practice Until it Feels Natural!</strong></h3>\n<p>Just like you’d practice for an important speech or a big performance, you must practice for your interview as well. A handful of candidates actually put enough practice (if any) time into effective practice.</p>\n<p>Having outlined your main speaking points <strong>in writing</strong>, you now have to deliver this crucial information in a memorable and persuasive way. For this, <strong>you need to speak those selling points out loud (with your notes at first and eventually without them). </strong>This practice allows you to work out the kinks before you walk into the interview and helps you in remembering the points even when you are a bundle of nerves!</p>\n<p>An interview is all about making a lasting impression. If you’re able to hold the interviewer’s attention and make them remember you, you’ve already paved your way to getting the job! All the best! </p>\n<h2>Recap</h2>\n<ul>\n<li>Analyze</li>\n<li>Hone your speaking points</li>\n<li>Practice until it feels natural</li>\n</ul>\n<p><em>Image credits: Nik MacMillan on Unsplash</em></p>",
            "image": "https://guide.makemyresume.co.in/media/posts/5/nik-macmillan-280300-1-lg1.jpg",
            "author": {
                "name": "MakeMyResume"
            },
            "tags": [
                   "Interview Prep"
            ],
            "date_published": "2021-02-22T20:15:00+05:30",
            "date_modified": "2021-07-06T13:41:04+05:30"
        }
    ]
}
